DataProcessors/ЗагрузкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовВалют</Name>
			<Comment>Загрузка курсов валют с сайта finance.ua</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БукваДиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаКурсовВалют/Ext/ObjectModule.bsl
Перем ИмяФайла;

Перем СерверИсточник;
Перем СтрокаПараметраПолучения;
Перем ИмяВходящегоФайла;

Перем ОшибкаКодаСервера;

//#Если Клиент Тогда
// 
//#КонецЕсли


// Выделяет из переданной строки первое значение
 //  до символа "TAB"
 //
 // Параметры: 
 //  ИсходнаяСтрока - Строка - строка для разбора
 //
 // Возвращаемое значение:
 //  подстроку до символа "TAB"
 //
Функция ВыделитьПодСтроку(ИсходнаяСтрока)

	Перем ПодСтрока;
	
    Поз = Найти(ИсходнаяСтрока,Символы.Таб);
	Если Поз > 0 Тогда
		ПодСтрока = Лев(ИсходнаяСтрока,Поз-1);
		ИсходнаяСтрока = Сред(ИсходнаяСтрока,Поз+1);
	Иначе
		ПодСтрока = ИсходнаяСтрока;
		ИсходнаяСтрока = "";
	КонецЕсли;
	
	Возврат ПодСтрока;
 
 КонецФункции // ВыделитьПодСтроку()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Производит загрузку курсов и кратностей валют с сайта finance.ua по ежедневным настройкам
//
Функция КодДоступаАктуален() Экспорт
	
	Перем HTTP;
	
	ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
	Настройки 		  = ЗначениеКонстанты.Получить();
	
	Если ПустаяСтрока(Настройки.КодДоступа) Тогда
		Возврат Ложь;
	КонецЕсли;
	КодДоступа = Настройки.КодДоступа;
	
	//пытаемся прочитать вчерашний курс
 	КонДата = ТекущаяДата()-60*60*24;

	ЗапомнитьИмяИПароль = Настройки.ЗапомнитьИмяИПароль;

	Если ЗапомнитьИмяИПароль Тогда
		ИмяПользователя 	= Настройки.ИмяПользователя;
		ПарольПользователя 	= Настройки.ПарольПользователя;
	КонецЕсли;
	
	СерверИсточник = "fin.1c.ua";

	Код = "?"+КодДоступа;
	Адрес = "1c/";     // по 1 дате
	ТМП   = "/"+Формат(Год(КонДата),"ЧРГ=; ЧГ=0")+"/"+Формат(Месяц(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=")+"/"+Формат(День(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=");

	ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
	СоздатьКаталог(ВремКаталог);
	УдалитьФайлы(ВремКаталог,"*.*");
	
	ИмяВходящегоФайла = "" + ВремКаталог + "\" + ИмяФайла;
	СтрокаПараметраПолучения = Адрес + "840" + ТМП + ".tsv" + СокрЛП(Код);
	Возврат ЗапроситьФайлыССервера(СерверИсточник, СтрокаПараметраПолучения, ИмяВходящегоФайла, HTTP);
	

КонецФункции // ПроверитьАктуальностьКодаДоступа()

// Производит загрузку курсов и кратностей валют с сайта finance.ua по ежедневным настройкам
//
Процедура ЗагрузитьКурсыПоНастройкам() Экспорт
	
	ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
	Настройки 		  = ЗначениеКонстанты.Получить();
	
	НачДата = ТекущаяДата();
	КонДата = ТекущаяДата();

	ЗапомнитьИмяИПароль = Настройки.ЗапомнитьИмяИПароль;

	Если ЗапомнитьИмяИПароль Тогда
		ИмяПользователя 	= Настройки.ИмяПользователя;
		ПарольПользователя 	= Настройки.ПарольПользователя;
	КонецЕсли;
	
	КодДоступа = Настройки.КодДоступа;
	
	Валюты = Настройки.СписокВалют;
	СписокВалют.Очистить();
	Для сч=0 По Валюты.Количество()-1 Цикл
		Вал = СписокВалют.Добавить();
		Вал.Валюта = Валюты[сч];
		Вал.Пометка = Истина;
	КонецЦикла;
	
	ЗагрузитьКурсы(,,Истина);

КонецПроцедуры // ЗагрузитьКурсыПоНастройкам()

// Производит загрузку курсов и кратностей валют с сайта finance.ua
//
// Параметры:
//  ИндикаторФормы     - ЭлементыФормы типа Индикатор - для отработки индикатора формы
//  НадписьВалютыФормы - ЭлементыФормы типа Надпись  - Для отработки надписи 
//													   загружаемой валюты
//
Процедура ЗагрузитьКурсы(ИндикаторФормы = Неопределено , НадписьВалютыФормы = Неопределено, ВыводитьСообщения = Ложь ) Экспорт
	
	Перем HTTP;
	
	РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
	ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();

	Текст = Новый ТекстовыйДокумент();

	СерверИсточник = "fin.1c.ua";

	Адрес1 = "1c/cb/";  // в интервале
	Адрес2 = "1c/";     // по 1 дате
	
	Код = ?(КодДоступа <> Неопределено, "?"+КодДоступа, "");
	
	Если НачДата = КонДата Тогда  // по 1 дате
		Адрес = Адрес2;
		ТМП   = "/"+Формат(Год(КонДата),"ЧРГ=; ЧГ=0")+"/"+Формат(Месяц(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=")+"/"+Формат(День(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=");
	Иначе    // в интервале
		Адрес = Адрес1;
		ТМП   = "";
	КонецЕсли;

	ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
	СоздатьКаталог(ВремКаталог);
	УдалитьФайлы(ВремКаталог,"*.*");
	
	Для каждого СтрокаСпВалют из СписокВалют Цикл
		Если НЕ СтрокаСпВалют.Пометка Тогда
			Продолжить;	
		КонецЕсли;
		
		ТекВалюта = СтрокаСпВалют.Валюта;
		Стр = "";
		
		Если ВыводитьСообщения Тогда 
			Сообщить(Локализация.СтрШаблон(НСтр("ru='Загружается курс для ¤1¤ (код ¤2¤).';uk='Завантажується курс для ¤1¤ (код ¤2¤).'"), СокрЛП(ТекВалюта.Наименование), ТекВалюта.Код)); 	
		КонецЕсли;
		
		ИмяВходящегоФайла = "" + ВремКаталог + "\" + ИмяФайла;
		СтрокаПараметраПолучения = Адрес + Прав(ТекВалюта.Код,3) + ТМП + ".tsv" + СокрЛП(Код);
		Если ЗапроситьФайлыССервера(СерверИсточник, СтрокаПараметраПолучения, ИмяВходящегоФайла, HTTP) <> Истина Тогда
			Сообщить(Локализация.СтрШаблон(НСтр("ru='Не удалось получить ресурс для валюты ¤1¤ (код ¤2¤). Курс для валюты не загружен.';uk='Не вдалося одержати ресурс для валюти ¤1¤ (код ¤2¤). Курс для валюти не завантажений.'"), СокрЛП(ТекВалюта.Наименование), ТекВалюта.Код)); 
			Если ОшибкаКодаСервера Тогда
				Прервать;
			КОнецЕсли;
			Продолжить;
		КонецЕсли; 

		ВходящийФайл = Новый Файл(ИмяВходящегоФайла);
		Если НЕ ВходящийФайл.Существует() Тогда
			Сообщить(Локализация.СтрШаблон(НСтр("ru='Не удалось получить ресурс для валюты ¤1¤ (код ¤2¤). Курс для валюты не загружен.';uk='Не вдалося одержати ресурс для валюти ¤1¤ (код ¤2¤). Курс для валюти не завантажений.'"), СокрЛП(ТекВалюта.Наименование), ТекВалюта.Код)); 
			Продолжить;
		КонецЕсли;	

		Текст.Прочитать(ИмяВходящегоФайла,КодировкаТекста.ANSI);
		
		КолСтрок = Текст.КоличествоСтрок();
		Для Инд = 1 По КолСтрок Цикл
			НадписьВалютыФормы = СокрЛП(ТекВалюта.Наименование);

			ИндикаторФормы = Инд/КолСтрок * 100;
				
			Стр = Текст.ПолучитьСтроку(Инд);
			Если (Стр = "") ИЛИ (Найти(Стр,Символы.Таб) = 0) Тогда
			   Продолжить;
			КонецЕсли;
			Если НачДата = КонДата Тогда  
			   ДатаКурса = КонДата;
			Иначе 
			   ДатаКурсаСтр = ВыделитьПодСтроку(Стр);
			   ДатаКурса    = Дата(Лев(ДатаКурсаСтр,4),Сред(ДатаКурсаСтр,5,2),Сред(ДатаКурсаСтр,7,2));
			КонецЕсли;
			Кратность = Число(ВыделитьПодСтроку(Стр));
			Курс      = Число(ВыделитьПодСтроку(Стр));

			Если ДатаКурса > КонДата Тогда
			   Прервать;
			КонецЕсли;

			Если ДатаКурса < НачДата Тогда 
			   Продолжить;
			КонецЕсли;

            ЗаписьКурсовВалют.Валюта = ТекВалюта;
			ЗаписьКурсовВалют.Период = ДатаКурса;
			ЗаписьКурсовВалют.Прочитать();
			ЗаписьКурсовВалют.Валюта    = ТекВалюта;
			ЗаписьКурсовВалют.Период    = ДатаКурса;
			ЗаписьКурсовВалют.Курс      = Курс;
			ЗаписьКурсовВалют.Кратность = Кратность;
			ЗаписьКурсовВалют.Записать();
		КонецЦикла;
		
		Если ВыводитьСообщения Тогда 
			Сообщить(Локализация.СтрШаблон(НСтр("ru='Курс для ¤1¤ (код ¤2¤) загружен.';uk='Курс для ¤1¤ (код ¤2¤) завантажений.'"), СокрЛП(ТекВалюта.Наименование), ТекВалюта.Код)); 	
		КонецЕсли;
		
	КонецЦикла;	
	УдалитьФайлы(ВремКаталог,"*.*");

КонецПроцедуры // ЗагрузитьКурсы()

// Производит загрузку курсов и кратностей валют с диска ИТС
//
// Параметры:
//  ИндикаторФормы     - ЭлементыФормы типа Индикатор - для отработки индикатора формы
//  НадписьВалютыФормы - ЭлементыФормы типа Надпись  - Для отработки надписи 
//													   загружаемой валюты
//
Процедура ЗагрузитьКурсыСИТС(ИндикаторФормы = Неопределено ,НадписьВалютыФормы = Неопределено, ВыводитьСообщения = Ложь ) Экспорт
	Если БукваДиска = "" Тогда 
		Сообщить(Локализация.СтрШаблон(НСтр("ru='Не указана буква привода дисков CD-ROM.';uk='Не зазначена буква приводу дисків CD-ROM.'"))); 
	ИначеЕсли НачДата < НачалоГода(ДобавитьМесяц(ТекущаяДата(), -12)) ИЛИ КонДата > КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)) Тогда
		Сообщить(Локализация.СтрШаблон(НСтр("ru='На диске ИТС доступны курсы с ¤1¤ по ¤2¤. Курс для валюты не загружен.';uk='На диску ІТС доступні курси з ¤1¤ по ¤2¤. Курс для валюти не завантажений.'"), Формат(НачалоГода(ДобавитьМесяц(ТекущаяДата(), -12)),"ДЛФ=Д") , Формат(КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)),"ДЛФ=Д"))); 	
	Иначе
	
		Если (ИндикаторФормы = Неопределено) И (НадписьВалютыФормы = Неопределено) Тогда
			ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
			Если ЗначениеКонстанты <> Неопределено Тогда
				Настройки = ЗначениеКонстанты.Получить();
			КонецЕсли;
			Валюты = Настройки.СписокВалют;
			СписокВалют.Очистить();
			Для сч=0 По Валюты.Количество()-1 Цикл
				Вал = СписокВалют.Добавить();
				Вал.Валюта = Валюты[сч];
				Вал.Пометка = Истина;
			КонецЦикла;
		КонецЕсли;
		
		РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
		ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();

		Текст = Новый ТекстовыйДокумент();
			
		Адрес = БукваДиска + ":\1CIts\EXE\Finance\";

		ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
		СоздатьКаталог(ВремКаталог);
		УдалитьФайлы(ВремКаталог,"*.*");
		
		Для каждого СтрокаСпВалют из СписокВалют Цикл
            Если НЕ СтрокаСпВалют.Пометка Тогда
				Продолжить;	
			КонецЕсли;
			
			ТекВалюта = СтрокаСпВалют.Валюта;
			Стр = "";
			
			Если ВыводитьСообщения Тогда 
				Сообщить(Локализация.СтрШаблон(НСтр("ru='Загружается курс для ¤1¤ (код ¤2¤).';uk='Завантажується курс для ¤1¤ (код ¤2¤).'"), СокрЛП(ТекВалюта.Наименование), ТекВалюта.Код)); 	
			КонецЕсли;
			
			СтрокаПараметраПолучения = Адрес + Прав(ТекВалюта.Код,3) + ".tsv";

			ВходящийФайл = Новый Файл(СтрокаПараметраПолучения);
			Если НЕ ВходящийФайл.Существует() Тогда
				Сообщить(Локализация.СтрШаблон(НСтр("ru='Не удалось получить ресурс для валюты ¤1¤ (код ¤2¤). Курс для валюты не загружен.';uk='Не вдалося одержати ресурс для валюти ¤1¤ (код ¤2¤). Курс для валюти не завантажений.'"), СокрЛП(ТекВалюта.Наименование), ТекВалюта.Код)); 
				Продолжить;
			КонецЕсли;	

			Текст.Прочитать(СтрокаПараметраПолучения,КодировкаТекста.ANSI);
			
			КолСтрок = Текст.КоличествоСтрок();
			Для Инд = 1 По КолСтрок Цикл
				НадписьВалютыФормы = СокрЛП(ТекВалюта.Наименование);

				ИндикаторФормы = Инд/КолСтрок * 100;
					
				Стр = Текст.ПолучитьСтроку(Инд);
				Если (Стр = "") ИЛИ (Найти(Стр,Символы.Таб) = 0) Тогда
				   Продолжить;
				КонецЕсли;
				Если НачДата = КонДата Тогда  
				   ДатаКурса = КонДата;
				Иначе 
				   ДатаКурсаСтр = ВыделитьПодСтроку(Стр);
				   ДатаКурса    = Дата(Лев(ДатаКурсаСтр,4),Сред(ДатаКурсаСтр,5,2),Сред(ДатаКурсаСтр,7,2));
				КонецЕсли;
				Кратность = Число(ВыделитьПодСтроку(Стр));
				Курс      = Число(ВыделитьПодСтроку(Стр));

				Если ДатаКурса > КонДата Тогда
				   Прервать;
				КонецЕсли;

				Если ДатаКурса < НачДата Тогда 
				   Продолжить;
				КонецЕсли;

	            ЗаписьКурсовВалют.Валюта = ТекВалюта;
				ЗаписьКурсовВалют.Период = ДатаКурса;
				ЗаписьКурсовВалют.Прочитать();
				ЗаписьКурсовВалют.Валюта    = ТекВалюта;
				ЗаписьКурсовВалют.Период    = ДатаКурса;
				ЗаписьКурсовВалют.Курс      = Курс;
				ЗаписьКурсовВалют.Кратность = Кратность;
				ЗаписьКурсовВалют.Записать();
			КонецЦикла;
			
			Если ВыводитьСообщения Тогда 
				Сообщить(Локализация.СтрШаблон(НСтр("ru='Курс для ¤1¤ (код ¤2¤) загружен.';uk='Курс для ¤1¤ (код ¤2¤) завантажений.'"), СокрЛП(ТекВалюта.Наименование), ТекВалюта.Код)); 	
			КонецЕсли;
			
		КонецЦикла;	
		УдалитьФайлы(ВремКаталог,"*.*");
	КонецЕсли;

КонецПроцедуры // ЗагрузитьКурсы()

////////////////////////////////////////////////////////////////////////////////

// Функция создает HTTP соединение используя параметры
// Прокси-сервера, вводимые пользователем
//
// Возвращаемое значение:
//   HTTPСоединение
//
Функция СоздатьСоединение()

	Перем HTTP;
	Перем ПроксиСервер;
	
	Если ЗначениеЗаполнено(ИмяПользователя) Тогда
		ПроксиСервер = Новый ИнтернетПрокси();
		ПроксиСервер.Пользователь = ИмяПользователя;
		ПроксиСервер.Пароль       = ПарольПользователя;
		HTTP = Новый HTTPСоединение(СерверИсточник,,,, ПроксиСервер);
	Иначе
		HTTP = Новый HTTPСоединение(СерверИсточник);
	КонецЕсли;
	
	Возврат HTTP;
	
КонецФункции

// Функция получает файлы с сервера с указанными параметрами и сохраняет на диск
//
// Параметры:
// СерверИсточникПараметр - Строка, сервер, с которого необходимо получить файлы
// СтрокаПараметраПолученияПараметр - Строка, адрес ресурса на сервере.
// ИмяВходящегоФайлаПараметр - Имя файла, в который помещаются данные полученного ресурса.
// HTTP - HTTPСоединение, если приходится использовать данную функцию в цикле, то тут передается
//         переменная с созданным в предыдущей итерации цикла HTTPСоединением
//
// Возвращаемое значение:
//  Булево - Успешно получены файлы или нет.
//
Функция ЗапроситьФайлыССервера(СерверИсточникПараметр, СтрокаПараметраПолученияПараметр, ИмяВходящегоФайлаПараметр, HTTP = Неопределено)
	
	СерверИсточник           = СерверИсточникПараметр;
	СтрокаПараметраПолучения = СтрокаПараметраПолученияПараметр;
	ИмяВходящегоФайла        = ИмяВходящегоФайлаПараметр;
	Заголовки = "";
	ФормаОшибки = ЭтотОбъект.ПолучитьФорму("ФормаОшибки"); 
	
	Если ТипЗнч(HTTP) <> Тип("HTTPСоединение") Тогда
		HTTP = СоздатьСоединение();
	КонецЕсли; 
	
	Попытка
		HTTP.Получить(СтрокаПараметраПолучения, ИмяВходящегоФайла);
		Возврат Истина;
	Исключение
		СтрОписаниеОшибки = ОписаниеОшибки(); 
		Если ПустаяСтрока(СтрОписаниеОшибки) <> 0 Тогда
			ФормаОшибки.Панель.ТекущаяСтраница = ФормаОшибки.Панель.Страницы.Страница0;
			ОшибкаКодаСервера = Истина;
			ФормаОшибки.ОткрытьМодально();
		ИначеЕсли Найти(СтрОписаниеОшибки, "407") <> 0 И Найти(НРег(СтрОписаниеОшибки), "unauthorized") <> 0 Тогда
			ФормаОшибки.Панель.ТекущаяСтраница = ФормаОшибки.Панель.Страницы.Страница407;
			ОшибкаКодаСервера = Истина;
			ФормаОшибки.ОткрытьМодально();
		ИначеЕсли Найти(СтрОписаниеОшибки, "402") <> 0 Тогда
			ФормаОшибки.Панель.ТекущаяСтраница = ФормаОшибки.Панель.Страницы.Страница402;
			ОшибкаКодаСервера = Истина;
			ФормаОшибки.ОткрытьМодально();
		ИначеЕсли Найти(СтрОписаниеОшибки, "403") <> 0 Тогда
			ФормаОшибки.Панель.ТекущаяСтраница = ФормаОшибки.Панель.Страницы.Страница403;
			ОшибкаКодаСервера = Истина;
			ФормаОшибки.ОткрытьМодально();
		ИначеЕсли Найти(СтрОписаниеОшибки, "500") <> 0 Тогда
			ФормаОшибки.Панель.ТекущаяСтраница = ФормаОшибки.Панель.Страницы.Страница500;
			ОшибкаКодаСервера = Истина;
			ФормаОшибки.ОткрытьМодально();
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецПопытки;

КонецФункции

Процедура ОткрытьСайтФинансУа() Экспорт
	ЗапуститьПриложение("http://1c.finance.ua");
КонецПроцедуры

      

Функция ПолучитьСсылкуКурсовВалют(ИсточникКурсов) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИсточникКурсов) Тогда
		Возврат "";
	КонецЕсли;
	
	Соответствия = ПолучитьСоответствиеКурсовВалют();
	
	Если Соответствия[ИсточникКурсов] <> Неопределено Тогда
		Возврат Соответствия.Получить(ИсточникКурсов);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

  Функция ПолучитьСоответствиеКурсовВалют() Экспорт
	
	Соответствия = Новый Соответствие;
	
	Соответствия.Вставить("НБУ", "https://bank.gov.ua/NBUStatService/v1/statdirectory/exchange?json");
	Соответствия.Вставить("ПриватБанк", "https://api.privatbank.ua/p24api/pubinfo?json&exchange&coursid=5");
	Соответствия.Вставить("Monobank", "https://api.monobank.ua/bank/currency");
	
	Возврат Соответствия;
	
КонецФункции
  Функция ПолучитьТекстПоСсылке(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		
		Если Лев(Ссылка, 8) = "https://" Тогда
			
			БезПротокола = Сред(Ссылка, 9);
			ПозицияСлеша = Найти(БезПротокола, "/");
			
			Если ПозицияСлеша > 0 Тогда
				Сервер = Лев(БезПротокола, ПозицияСлеша - 1);
				Путь = Сред(БезПротокола, ПозицияСлеша);
			Иначе
				Сервер = БезПротокола;
				Путь = "/";
			КонецЕсли;
			
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
			Соединение = Новый HTTPСоединение(Сервер, 443,,,,, ЗащищенноеСоединение);
			
		ИначеЕсли Лев(Ссылка, 7) = "http://" Тогда
			
			БезПротокола = Сред(Ссылка, 8);
			ПозицияСлеша = Найти(БезПротокола, "/");
			
			Если ПозицияСлеша > 0 Тогда
				Сервер = Лев(БезПротокола, ПозицияСлеша - 1);
				Путь = Сред(БезПротокола, ПозицияСлеша);
			Иначе
				Сервер = БезПротокола;
				Путь = "/";
			КонецЕсли;
			
			Соединение = Новый HTTPСоединение(Сервер, 80);
			
		Иначе
			Возврат "";
		КонецЕсли;
		
		Запрос = Новый HTTPЗапрос(Путь);
		Ответ = Соединение.Получить(Запрос);
		
		Если Ответ = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат "";
		КонецЕсли;
		
		Возврат Ответ.ПолучитьТелоКакСтроку();
		
	Исключение
		
		// если нужно — можешь включить отладку
		// Сообщить(ОписаниеОшибки());
		
		Возврат "";
		
	КонецПопытки;
	
КонецФункции


Процедура ПолучитьСписокВалют(СписокВалют, ИсточникКурсов) Экспорт  
	
	URL = ПолучитьСсылкуКурсовВалют(ИсточникКурсов);
	
	Если НЕ ЗначениеЗаполнено(URL) Тогда
		Сообщить("Не заполнена ссылка источника курсов");
		Возврат;
	КонецЕсли;
	
	ТекстОтвета = ПолучитьТекстПоСсылке(URL);
	
	Если НЕ ЗначениеЗаполнено(ТекстОтвета) Тогда
		Сообщить("Не удалось получить ответ по ссылке: " + URL);
		Возврат;
	КонецЕсли;  
	
	
	Для каждого СтрокаСпВалют Из СписокВалют Цикл
		
		ТекВалюта = СтрокаСпВалют;
		КодВалюты = ТекВалюта.Наименование;
		Курс = Неопределено;
		
		Если ИсточникКурсов = "НБУ" Тогда
			
			Курс = ПолучитьКурсНБУИзJSON(ТекстОтвета, КодВалюты);
			
		ИначеЕсли ИсточникКурсов = "ПриватБанк" Тогда
			
			// можно заменить "buy" на "sale", если тебе нужен курс продажи
			Курс = ПолучитьКурсПриватИзJSON(ТекстОтвета, КодВалюты, "buy");
			
		ИначеЕсли ИсточникКурсов = "Monobank" Тогда
			
			Курс = ПолучитьКурсMonobankИзJSON(ТекстОтвета, КодВалюты, "rateBuy");
			
			Если Курс = Неопределено Тогда
				Курс = ПолучитьКурсMonobankИзJSON(ТекстОтвета, КодВалюты, "rateCross");
			КонецЕсли;
			
		КонецЕсли;
		
		Если Курс <> Неопределено Тогда
			Сообщить(ИсточникКурсов + " " + КодВалюты + " - " + Строка(Курс));
			
			РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
			ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();			
			
			ДатаКурса = ТекущаяДата();
			
			ЗаписьКурсовВалют.Валюта = ТекВалюта;
			ЗаписьКурсовВалют.Период = ДатаКурса;
			ЗаписьКурсовВалют.Прочитать();
			ЗаписьКурсовВалют.Валюта    = ТекВалюта;
			ЗаписьКурсовВалют.Период    = ДатаКурса;
			ЗаписьКурсовВалют.Курс      = Курс;
			ЗаписьКурсовВалют.Кратность = 1;
			ЗаписьКурсовВалют.Записать();

		Иначе
			Сообщить(КодВалюты + " - курс не найден");
		КонецЕсли;
	
	КонецЦикла;	
	
	ДокументыУстановкиЦен = Документы.УстановкаЦенНоменклатуры.ПолучитьДокументыДляПерепроведенияПослеИзмененияКурса();
	
	Для Каждого Док из ДокументыУстановкиЦен Цикл 
       	Док.Получитьобъект().Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла; 

КонецПроцедуры


Функция ПолучитьОбъектВалютыНБУИзJSON(ТекстJSON, КодВалюты) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстJSON) ИЛИ НЕ ЗначениеЗаполнено(КодВалюты) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.ПС, "");
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.ВК, "");
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.Таб, "");
	
	КодВалютыСтрокой = ВРег(СокрЛП(Строка(КодВалюты)));
	
	ШаблонПоиска = """cc"":""" + КодВалютыСтрокой + """";
	ПозицияКода = Найти(ТекстJSON, ШаблонПоиска);
	
	Если ПозицияКода = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	НачалоОбъекта = ПозицияКода;
	Пока НачалоОбъекта > 1 Цикл
		Если Сред(ТекстJSON, НачалоОбъекта, 1) = "{" Тогда
			Прервать;
		КонецЕсли;
		НачалоОбъекта = НачалоОбъекта - 1;
	КонецЦикла;
	
	Если Сред(ТекстJSON, НачалоОбъекта, 1) <> "{" Тогда
		Возврат "";
	КонецЕсли;
	
	КонецОбъекта = ПозицияКода;
	Пока КонецОбъекта <= СтрДлина(ТекстJSON) Цикл
		Если Сред(ТекстJSON, КонецОбъекта, 1) = "}" Тогда
			Прервать;
		КонецЕсли;
		КонецОбъекта = КонецОбъекта + 1;
	КонецЦикла;
	
	Если КонецОбъекта > СтрДлина(ТекстJSON) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Сред(ТекстJSON, НачалоОбъекта, КонецОбъекта - НачалоОбъекта + 1);
	
КонецФункции

Функция ПолучитьКурсНБУИзJSON(ТекстJSON, КодВалюты) Экспорт
	
	ТекстОбъекта = ПолучитьОбъектВалютыНБУИзJSON(ТекстJSON, КодВалюты);
	
	Если НЕ ЗначениеЗаполнено(ТекстОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаКурса = ПолучитьЗначениеJSONПоля(ТекстОбъекта, "rate");
	
	Если НЕ ЗначениеЗаполнено(СтрокаКурса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаКурса = СтрЗаменить(СтрокаКурса, ".", ",");
	
	Попытка
		Возврат Число(СтрокаКурса);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьДанныеВалютыНБУИзJSON(ТекстJSON, КодВалюты) Экспорт
	
	ТекстОбъекта = ПолучитьОбъектВалютыНБУИзJSON(ТекстJSON, КодВалюты);
	
	Если НЕ ЗначениеЗаполнено(ТекстОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Код", ПолучитьЗначениеJSONПоля(ТекстОбъекта, "cc"));
	Результат.Вставить("Наименование", ПолучитьЗначениеJSONПоля(ТекстОбъекта, "txt"));
	Результат.Вставить("ДатаКурса", ПолучитьЗначениеJSONПоля(ТекстОбъекта, "exchangedate"));
	Результат.Вставить("R030", ПолучитьЗначениеJSONПоля(ТекстОбъекта, "r030"));
	Результат.Вставить("Special", ПолучитьЗначениеJSONПоля(ТекстОбъекта, "special"));
	
	СтрокаКурса = ПолучитьЗначениеJSONПоля(ТекстОбъекта, "rate");
	СтрокаКурса = СтрЗаменить(СтрокаКурса, ".", ",");
	
	Попытка
		Результат.Вставить("Курс", Число(СтрокаКурса));
	Исключение
		Результат.Вставить("Курс", 0);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбъектИзJSONПоШаблону(ТекстJSON, ШаблонПоиска) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстJSON) ИЛИ НЕ ЗначениеЗаполнено(ШаблонПоиска) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.ПС, "");
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.ВК, "");
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.Таб, "");
	
	ПозицияКода = Найти(ТекстJSON, ШаблонПоиска);
	
	Если ПозицияКода = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	НачалоОбъекта = ПозицияКода;
	Пока НачалоОбъекта > 1 Цикл
		Если Сред(ТекстJSON, НачалоОбъекта, 1) = "{" Тогда
			Прервать;
		КонецЕсли;
		НачалоОбъекта = НачалоОбъекта - 1;
	КонецЦикла;
	
	Если Сред(ТекстJSON, НачалоОбъекта, 1) <> "{" Тогда
		Возврат "";
	КонецЕсли;
	
	КонецОбъекта = ПозицияКода;
	Пока КонецОбъекта <= СтрДлина(ТекстJSON) Цикл
		Если Сред(ТекстJSON, КонецОбъекта, 1) = "}" Тогда
			Прервать;
		КонецЕсли;
		КонецОбъекта = КонецОбъекта + 1;
	КонецЦикла;
	
	Если КонецОбъекта > СтрДлина(ТекстJSON) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Сред(ТекстJSON, НачалоОбъекта, КонецОбъекта - НачалоОбъекта + 1);
	
КонецФункции

Функция ПолучитьЗначениеJSONПоля(ТекстОбъекта, ИмяПоля) Экспорт
	
	ШаблонПоля = """" + ИмяПоля + """:";
	ПозицияПоля = Найти(ТекстОбъекта, ШаблонПоля);
	
	Если ПозицияПоля = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	НачалоЗначения = ПозицияПоля + СтрДлина(ШаблонПоля);
	
	Пока НачалоЗначения <= СтрДлина(ТекстОбъекта) Цикл
		Символ = Сред(ТекстОбъекта, НачалоЗначения, 1);
		Если Символ <> " " И Символ <> Символы.Таб И Символ <> Символы.ПС И Символ <> Символы.ВК Тогда
			Прервать;
		КонецЕсли;
		НачалоЗначения = НачалоЗначения + 1;
	КонецЦикла;
	
	Если НачалоЗначения > СтрДлина(ТекстОбъекта) Тогда
		Возврат "";
	КонецЕсли;
	
	ПервыйСимвол = Сред(ТекстОбъекта, НачалоЗначения, 1);
	
	Если ПервыйСимвол = """" Тогда
		
		НачалоСтроки = НачалоЗначения + 1;
		КонецСтроки = НачалоСтроки;
		
		Пока КонецСтроки <= СтрДлина(ТекстОбъекта) Цикл
			Если Сред(ТекстОбъекта, КонецСтроки, 1) = """" Тогда
				Прервать;
			КонецЕсли;
			КонецСтроки = КонецСтроки + 1;
		КонецЦикла;
		
		Если КонецСтроки > СтрДлина(ТекстОбъекта) Тогда
			Возврат "";
		КонецЕсли;
		
		Возврат Сред(ТекстОбъекта, НачалоСтроки, КонецСтроки - НачалоСтроки);
		
	КонецЕсли;
	
	Если НРег(Сред(ТекстОбъекта, НачалоЗначения, 4)) = "null" Тогда
		Возврат "";
	КонецЕсли;
	
	КонецЗначения = НачалоЗначения;
	Пока КонецЗначения <= СтрДлина(ТекстОбъекта) Цикл
		Символ = Сред(ТекстОбъекта, КонецЗначения, 1);
		Если Символ = "," ИЛИ Символ = "}" ИЛИ Символ = "]" Тогда
			Прервать;
		КонецЕсли;
		КонецЗначения = КонецЗначения + 1;
	КонецЦикла;
	
	ЗначениеПоля = СокрЛП(Сред(ТекстОбъекта, НачалоЗначения, КонецЗначения - НачалоЗначения));
	Возврат ЗначениеПоля;
	
КонецФункции

Функция ПолучитьОбъектВалютыПриватИзJSON(ТекстJSON, КодВалюты) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстJSON) ИЛИ НЕ ЗначениеЗаполнено(КодВалюты) Тогда
		Возврат "";
	КонецЕсли;
	
	КодВалютыСтрокой = ВРег(СокрЛП(Строка(КодВалюты)));
	ШаблонПоиска = """ccy"":""" + КодВалютыСтрокой + """";
	
	Возврат ПолучитьОбъектИзJSONПоШаблону(ТекстJSON, ШаблонПоиска);
	
КонецФункции

Функция ПолучитьКурсПриватИзJSON(ТекстJSON, КодВалюты, ВидКурса = "buy") Экспорт
	
	ТекстОбъекта = ПолучитьОбъектВалютыПриватИзJSON(ТекстJSON, КодВалюты);
	
	Если НЕ ЗначениеЗаполнено(ТекстОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидКурса) Тогда
		ВидКурса = "buy";
	КонецЕсли;
	
	СтрокаКурса = ПолучитьЗначениеJSONПоля(ТекстОбъекта, ВидКурса);
	
	Если НЕ ЗначениеЗаполнено(СтрокаКурса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаКурса = СтрЗаменить(СтрокаКурса, ".", ",");
	
	Попытка
		Возврат Число(СтрокаКурса);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьКодВалютыMonobank(КодВалюты) Экспорт
	
	КодВалютыСтрокой = ВРег(СокрЛП(Строка(КодВалюты)));
	
	Соответствия = Новый Соответствие;
	Соответствия.Вставить("USD", "840");
	Соответствия.Вставить("EUR", "978");
	Соответствия.Вставить("PLN", "985");
	Соответствия.Вставить("GBP", "826");
	Соответствия.Вставить("CHF", "756");
	Соответствия.Вставить("CNY", "156");
	Соответствия.Вставить("CZK", "203");
	Соответствия.Вставить("DKK", "208");
	Соответствия.Вставить("HUF", "348");
	Соответствия.Вставить("JPY", "392");
	Соответствия.Вставить("CAD", "124");
	Соответствия.Вставить("AUD", "36");
	Соответствия.Вставить("SEK", "752");
	Соответствия.Вставить("NOK", "578");
	
	Если Соответствия[КодВалютыСтрокой] <> неопределено Тогда
		Возврат Соответствия.Получить(КодВалютыСтрокой);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьОбъектВалютыMonobankИзJSON(ТекстJSON, КодВалюты) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстJSON) ИЛИ НЕ ЗначениеЗаполнено(КодВалюты) Тогда
		Возврат "";
	КонецЕсли;
	
	КодMonobank = ПолучитьКодВалютыMonobank(КодВалюты);
	
	Если НЕ ЗначениеЗаполнено(КодMonobank) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.ПС, "");
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.ВК, "");
	ТекстJSON = СтрЗаменить(ТекстJSON, Символы.Таб, "");
	
	ШаблонПоиска = """currencyCodeA"":" + КодMonobank + "," + """currencyCodeB"":980";
	
	Возврат ПолучитьОбъектИзJSONПоШаблону(ТекстJSON, ШаблонПоиска);
	
КонецФункции

Функция ПолучитьКурсMonobankИзJSON(ТекстJSON, КодВалюты, ВидКурса = "") Экспорт
	
	ТекстОбъекта = ПолучитьОбъектВалютыMonobankИзJSON(ТекстJSON, КодВалюты);
	
	Если НЕ ЗначениеЗаполнено(ТекстОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидКурса) Тогда
		СтрокаКурса = ПолучитьЗначениеJSONПоля(ТекстОбъекта, "rateBuy");
		Если НЕ ЗначениеЗаполнено(СтрокаКурса) Тогда
			СтрокаКурса = ПолучитьЗначениеJSONПоля(ТекстОбъекта, "rateCross");
		КонецЕсли;
	Иначе
		СтрокаКурса = ПолучитьЗначениеJSONПоля(ТекстОбъекта, ВидКурса);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаКурса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаКурса = СтрЗаменить(СтрокаКурса, ".", ",");
	
	Попытка
		Возврат Число(СтрокаКурса);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьКурсИзJSONПоИсточнику(Источник, ТекстJSON, КодВалюты, ВидКурса = "") Экспорт
	
	ИсточникСтрокой = ВРег(СокрЛП(Строка(Источник)));
	
	Если ИсточникСтрокой = ВРег("НБУ") Тогда
		Возврат ПолучитьКурсНБУИзJSON(ТекстJSON, КодВалюты);
	ИначеЕсли ИсточникСтрокой = ВРег("ПриватБанк") Тогда
		
		Если НЕ ЗначениеЗаполнено(ВидКурса) Тогда
			ВидКурса = "buy";
		КонецЕсли;
		
		Возврат ПолучитьКурсПриватИзJSON(ТекстJSON, КодВалюты, ВидКурса);
		
	ИначеЕсли ИсточникСтрокой = ВРег("Monobank") Тогда
		Возврат ПолучитьКурсMonobankИзJSON(ТекстJSON, КодВалюты, ВидКурса);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

 Процедура ЗагрузитьКурсыВалютРегламентноеЗадание() Экспорт
	
	ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
	Если ТипЗнч(ЗначениеКонстанты.Получить()) = Тип("Структура") Тогда
		Настройки = ЗначениеКонстанты.Получить();
		
		ИсточникКурсов      = Настройки.ИсточникКурсов; 
		Валюты = Настройки.СписокВалют;
		ПолучитьСписокВалют(Валюты, ИсточникКурсов);
		
	КонецЕсли;	
	
КонецПроцедуры     


ИмяФайла = "Curses.html"; 
ОшибкаКодаСервера = Ложь;
